<!doctype html>
<html lang="en">
<head>
    <meta charset="UTF-8">
    <title>Document</title>
</head>
<body>
<?php
echo "<br>Задача_1 (вариант 1)---------------------------------------------------------------<br>";

$n = 12;
$sum = (1 + 1 + 3*($n - 1))*$n/2; //формула суммы арифметической прогрессии
echo "При количестве элементов n = $n последовательности 1+4+7+10+... <br>сумма ее элементов \$sum = $sum.<br>";

echo "<br>Задача_1 (вариант 2) ---------------------------------------------------------------<br>";

$sum2=0;
$el=1;
for ($i=1; $i<=$n; $i++){
    $sum2 += $el;
    $el+=3;
}
echo "При количестве элементов n = $n последовательности 1+4+7+10+... <br>сумма ее элементов \$sum = $sum2.<br>";

echo "<br>Задача_2 ---------------------------------------------------------------<br>";

$n = 12;
$ar = array();
for ($i=0; $i<=$n; $i++){
    $ar[$i]=$i*$i;
}
print_r ($ar);


echo "<br><br>Задача_3 ---------------------------------------------------------------<br>";

$n = 14;
echo "Введено число $n<br>";
if ($n % 2 == 0){
    $n = $n / 2;
    echo "Поскольку введено парное число, результат равен $n.";
}
else {
    $n = $n * 3;
    echo "Поскольку введено непарное число, результат равен $n.";
}


echo "<br><br>Задача_4 ---------------------------------------------------------------<br>";

$a = 32;
$b = 14;

echo "Рассмотрим числа $a и $b. <br>";

if (($a - $b) <= 20 and ($a - $b) >= -20) echo 'Поскольку они отличаются не более чем на 20, результат - ДА.';
else echo 'Поскольку они отличаются более чем на 20, результат - НЕТ.';

echo "<br><br>Задача_5 ---------------------------------------------------------------<br>";

$ar = array(0, 9, 1, 8, 2, 7, 3, 6, 4, 5);
echo "Имеется исходный массив ";
print_r ($ar);
sort($ar);
echo '<br>Отсортированный с помощью функции sort() массив будет иметь вид: ';
foreach($ar as $m) echo "$m ";

$t = count($ar);
for ($i=0; $i <= $t; $i++){
    if ($ar[$i+1] < $ar[$i]) {
        $tmp = $ar[$i];
        $ar[$i] = $ar[$i+1];
        $ar[$i+1] = $tmp;
    }
    else continue;
}
echo '<br>Отсортированный с помощью цикла массив будет иметь вид: ';
foreach($ar as $d) echo "$d ";



?>
</body>
</html>