<!doctype html>
<html lang="en">
<head>
    <meta charset="UTF-8">
    <title>Document</title>
</head>
<body>
<?php

echo "<br>Задача_1 -----------------------------------------------------------<br>";
$name="Андрей";
$age="30";
echo "Меня зовут $name<br>";
echo "Мне $age лет ";

echo "<br>---------------------------------------------------------------<br>";

echo "<br>Задача_2 --------------------------------------------------------------<br>";

echo 'Вычислить площадь равностороннего треугольника, если его сторона а=5м.<br>';
$a=5;
$S=$a*sqrt(3)/2;
echo "Решение: S = a * √3 / 2 = $S м2";

echo "<br>---------------------------------------------------------------<br>";
?>
</body>
</html>